In [25]:
import pandas as pd
import numpy as np
import seaborn as sns
import sklearn as sk


df = pd.read_csv('adult.data.csv')


* How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.
* What is the average age of men?
* What is the percentage of people who have a Bachelor's degree?
* What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?
* What percentage of people without advanced education make more than 50K?
* What is the minimum number of hours a person works per week?
* What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?
* What country has the highest percentage of people that earn >50K and what is that percentage?
* Identify the most popular occupation for those who earn >50K in India.

In [17]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [27]:
race = df['race']

<bound method Series.mean of 0        White
1        White
2        White
3        Black
4        Black
         ...
32556    White
32557    White
32558    White
32559    White
32560    White
Name: race, Length: 32561, dtype: object>

In [38]:
# How many people of each race are represented in this dataset?
race_counts = race.value_counts()
race_counts

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: count, dtype: int64

In [76]:
age_sex = df[['age', 'sex']]
age_sex

       age     sex
0       39    Male
1       50    Male
2       38    Male
3       53    Male
4       28  Female
...    ...     ...
32556   27  Female
32557   40    Male
32558   58  Female
32559   22    Male
32560   52  Female

[32561 rows x 2 columns]

In [195]:
# What is the average age of men?
men = age_sex[age_sex['sex'] == 'Male'] #filtra apenas as linhas que contém o valor "Male"
average_age_men = men['age'].mean()
average_age_men.round()

39.0

In [93]:
education = df['education']
calculate_education = education.value_counts()
calculate_education

education
HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: count, dtype: int64

In [102]:
calculate_bachelors = calculate_education['Bachelors']
calculate_bachelors

5355

In [99]:
# What is the percentage of people who have a Bachelor's degree?
total_people = len(df)
percentage_bachelors = (calculate_bachelors / total_people) * 100
percentage_bachelors.round()

16.0

In [106]:
salary = df['salary']
education_salary = df[['education', 'salary']]
education_salary

        education salary
0       Bachelors  <=50K
1       Bachelors  <=50K
2         HS-grad  <=50K
3            11th  <=50K
4       Bachelors  <=50K
...           ...    ...
32556  Assoc-acdm  <=50K
32557     HS-grad   >50K
32558     HS-grad  <=50K
32559     HS-grad  <=50K
32560     HS-grad   >50K

[32561 rows x 2 columns]

In [137]:
make50more = education_salary[education_salary['education'].isin(['Bachelors', 'Masters', 'Doctorate'])]
make50more.value_counts()

education  salary
Bachelors  <=50K     3134
           >50K      2221
Masters    >50K       959
           <=50K      764
Doctorate  >50K       306
           <=50K      107
Name: count, dtype: int64

In [150]:
high_salary = make50more[make50more['salary'] == '>50K']
high_salary = high_salary.value_counts()
advanced_bachelors = high_salary.sum()
advanced_bachelors

3486

In [132]:
# What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?
percentage_highsalary = (high_salary / total_people) * 100
percentage_highsalary.round()

education  salary
Bachelors  >50K      7.0
Masters    >50K      3.0
Doctorate  >50K      1.0
Name: count, dtype: float64

In [162]:
# What percentage of people without advanced education make more than 50K?
bachelors = df[['education', 'salary']]
low_bachelor = bachelors[bachelors['salary'] == '>50K']
low_bachelor = low_bachelor.value_counts()
low_bachelor50 = low_bachelor.sum()
low_bachelor = low_bachelor50 - advanced_bachelors
percentage_lowbachelor = (low_bachelor / total_people) * 100
percentage_lowbachelor.round()

13.0

In [197]:
# What is the minimum number of hours a person works per week?
hours_per_week = df['hours-per-week']
hours_per_week.min()

1

In [193]:
# What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?
min_hours_per_week = hours_per_week.min()
min_work = df[['hours-per-week', 'salary']]
sum_hours = hours_per_week.sum()
percentage_lowhours = (min_hours_per_week / sum_hours) * 100
print('{:.5f}'.format(percentage_lowhours))

0.00008

In [212]:
country_salary_percentage = df[['native-country', 'salary']]
country_sum = country_salary_percentage.value_counts()
country_sum = country_sum.sum()
country_sum

32561

In [209]:
# What country has the highest percentage of people that earn >50K and what is that percentage?
country_salary_percentage = df[['native-country', 'salary']]
usa_salary = country_salary_percentage[country_salary_percentage['salary'] == '>50K']
usa_salary = usa_salary[usa_salary['native-country'] == 'United-States']
usa_salary

      native-country salary
7      United-States   >50K
8      United-States   >50K
9      United-States   >50K
10     United-States   >50K
19     United-States   >50K
...              ...    ...
32539  United-States   >50K
32545  United-States   >50K
32554  United-States   >50K
32557  United-States   >50K
32560  United-States   >50K

[7171 rows x 2 columns]

In [214]:
# What country has the highest percentage of people that earn >50K and what is that percentage?
usa_salary = usa_salary.value_counts().sum()
highest_percentage = (usa_salary / country_sum) * 100
highest_percentage.round()

22.0

In [233]:
df['occupation'].value_counts().sum()

32561

In [216]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [218]:
popular_occupation = df[['occupation', 'native-country', 'salary']]
popular_occupation

              occupation native-country salary
0           Adm-clerical  United-States  <=50K
1        Exec-managerial  United-States  <=50K
2      Handlers-cleaners  United-States  <=50K
3      Handlers-cleaners  United-States  <=50K
4         Prof-specialty           Cuba  <=50K
...                  ...            ...    ...
32556       Tech-support  United-States  <=50K
32557  Machine-op-inspct  United-States   >50K
32558       Adm-clerical  United-States  <=50K
32559       Adm-clerical  United-States  <=50K
32560    Exec-managerial  United-States   >50K

[32561 rows x 3 columns]

In [220]:
india_occupation = popular_occupation[popular_occupation['native-country'] == 'India']
india_occupation

            occupation native-country salary
11      Prof-specialty          India   >50K
892       Adm-clerical          India  <=50K
968    Exec-managerial          India   >50K
1029             Sales          India  <=50K
1095    Prof-specialty          India  <=50K
...                ...            ...    ...
30152   Prof-specialty          India   >50K
30833     Adm-clerical          India   >50K
30871   Prof-specialty          India  <=50K
31327   Prof-specialty          India   >50K
31357   Prof-specialty          India   >50K

[100 rows x 3 columns]

In [229]:
# Identify the most popular occupation for those who earn >50K in India.
india_occupation_salary = india_occupation[india_occupation['salary'] == '>50K']
prof_salary = india_occupation_salary[india_occupation_salary['occupation'] == 'Prof-specialty']
prof_salary.value_counts()

occupation      native-country  salary
Prof-specialty  India           >50K      25
Name: count, dtype: int64